{
    "reviewGroups": [
        {
            "id": 1,
            "reviews": [
                {
                    "reviewerName": "Tom Diaz",
                    "avatarUrl": "./assets/images/Tom.jpg",
                    "rating": 4.5,
                    "comment": "I’ve used several currency exchange services, but none compare to this one. The rates are excellent, and transfers are completed within minutes. I sent money from Canada to India and it arrived faster than I expected. The interface is smooth and easy to use, even for first-timers. Highly recommended for anyone looking for speed and transparency."
                },
                {
                    "reviewerName": "John Taylor",
                    "avatarUrl": "./assets/images/John-Taylor.jpg",
                    "rating": 5,
                    "comment": "This platform made sending money to my family abroad simple and stress-free. I especially appreciate the upfront exchange rates with no hidden fees. I’ve been using this service monthly and it’s always been reliable. The mobile app is intuitive and works seamlessly across devices. Excellent for digital nomads and expats alike."
                },
                {
                    "reviewerName": "Ryan Cooper",
                    "avatarUrl": "./assets/images/Ryan.jpg",
                    "rating": 5,
                    "comment": "As someone who travels often, I need a service I can trust—and this is it. I’ve made international transfers from Europe and Asia, all without issues. The rates are much better than traditional banks, and the support team is responsive. Every transaction has been smooth, fast, and cost-effective. A must-have for global travelers."
                },
                {
                    "reviewerName": "Sofia Vyas",
                    "avatarUrl": "./assets/images/Sofia.png",
                    "rating": 5,
                    "comment": "This exchange platform helped me avoid excessive bank charges during my recent trip. I transferred funds from the US to Germany and they arrived instantly. The sign-up process was easy, and I was exchanging money in minutes. I love that they offer real-time rate tracking and low fees. It’s now my go-to money transfer app."
                },
                {
                    "reviewerName": "Rachel Thompson",
                    "avatarUrl": "./assets/images/Rachel.jpg",
                    "rating": 4.5,
                    "comment": "Sending money home used to be frustrating, but not anymore. This service made it easy to support my family while working overseas. The process is streamlined, the fees are fair, and the money arrives on time. I can track everything from the app with just a few taps. Highly reliable and perfect for regular senders."
                }
            ]
        },
        {
            "id": 2,
            "reviews": [
                {
                    "reviewerName": "Krunal Kathiriya",
                    "avatarUrl": "./assets/images/krunal.jpg",
                    "rating": 4,
                    "comment": "I transferred money to the UK from Australia last week and it was seamless. The exchange rate was better than what my bank offered. It only took a few minutes to get everything set up and processed. Customer support was also helpful in answering my queries. I’ll definitely be using this again during my travels."
                },
                {
                    "reviewerName": "Lisa Carter",
                    "avatarUrl": "./assets/images/Lisa-Carter.jpg",
                    "rating": 4.5,
                    "comment": "I was nervous about sending money abroad for the first time, but this app made it easy. Everything was clearly explained, and the rates were better than my bank. I transferred money to Euro from the INR and it arrived the same day. The whole process felt secure and professional. I’ll definitely use it again for future trips."
                },
                {
                    "reviewerName": "Amelia Brown",
                    "avatarUrl": "./assets/images/Amelia.jpg",
                    "rating": 5,
                    "comment": "I discovered this platform while backpacking across South Asia. It’s been a game-changer for managing travel expenses across countries. Fast transfers, competitive rates, and a very user-friendly dashboard. I trust them with my money every time I move between regions. This is ideal for frequent flyers and remote workers."
                },
                {
                    "reviewerName": "Henry Walker",
                    "avatarUrl": "./assets/images/Henry.jpg",
                    "rating": 5,
                    "comment": "After testing several services, this one is by far the most consistent. I send funds monthly to my parents in Mexico, and there’s never been a delay. The platform is secure, and notifications keep me informed every step of the way. I also appreciate the rate lock feature. Perfect for international family support."
                },
                {
                    "reviewerName": "Hannah Smith",
                    "avatarUrl": "./assets/images/Hannah.jpg",
                    "rating": 4.5,
                    "comment": "Whether I’m in Europe or South America, this platform keeps me connected financially. The ability to send and receive money so easily is a huge relief. I like that I can set up recurring transfers and not worry about timing. It’s trustworthy, affordable, and efficient. A must-use for travelers on the move."
                }
            ]
        },
        {
            "id": 3,
            "reviews": [
                {
                    "reviewerName": "Sarah Mitchell",
                    "avatarUrl": "./assets/images/Sarah.jpg",
                    "rating": 4.5,
                    "comment": "I had my doubts at first, but this service exceeded expectations. I used it to send money from Dubai to India, and it worked flawlessly. The fees were low and clearly shown before confirming the transaction. I even got a better rate than my travel card. Five stars from a frequent international traveler."
                },
                {
                    "reviewerName": "Emily Clarke",
                    "avatarUrl": "./assets/images/Emily.avif",
                    "rating": 3.5,
                    "comment": "This is the only platform I trust when transferring funds internationally. I’ve used it across five different countries, and it hasn’t let me down. The exchange rate is better than PayPal and banks, and the UI is incredibly easy. Every time I travel, this app comes with me. A smart tool for global citizens."
                },
                {
                    "reviewerName": "Jake Miller",
                    "avatarUrl": "./assets/images/Jake.jpg",
                    "location": "Austin, TX",
                    "rating": 5,
                    "comment": "This money transfer app made my life so much easier as a travel photographer. I receive payments from clients globally without delays or surprises. The exchange rates are impressive and very close to market rates. Transfers complete in under 10 minutes in most cases. Couldn’t ask for a better experience."
                },
                {
                    "reviewerName": "Liam Brown",
                    "avatarUrl": "./assets/images/Liam.jpg",
                    "rating": 4.5,
                    "comment": "What impressed me most was how easy it was to get started. I sent my first transfer within 10 minutes of signing up. The rates beat most major services, and the app is extremely user-friendly. I’ve used it multiple times from different countries without issue. Great for peace of mind while traveling."
                }
            ]
        }
    ]
}