{
    "reviewGroups": [
        {
            "id": 1,
            "reviews": [
                {
                    "reviewerName": "Tom Diaz",
                    "avatarUrl": "./assets/images/Tom.jpg",
                    "rating": 4.5,
                    "comment": "Sending payments to my international contractors used to be a headache with high bank fees. This service is a game-changer! Transfers are incredibly fast, often arriving within minutes, and the exchange rates are much better than my bank. Saved me a significant amount last quarter. Highly recommend for small businesses."
                },
                {
                    "reviewerName": "James Collins",
                    "avatarUrl": "./assets/images/John-Taylor.jpg",
                    "rating": 5,
                    "comment": "Excellent and reliable service! I send money to my family in the Philippines every month. Never had an issue, the app is simple to use, and the transparency on fees is great. Gives me peace of mind knowing the money arrives safely and quickly."
                },
                {
                    "reviewerName": "Ryan Cooper",
                    "avatarUrl": "./assets/images/Ryan.jpg",
                    "rating": 5,
                    "comment": "As someone new to sending money abroad, I was nervous. Their platform made it surprisingly easy! The step-by-step process was clear, and my first transfer to Germany went smoothly. Customer support was also helpful when I had a question about verification. Great for beginners!"
                },
                {
                    "reviewerName": "Mark Evans",
                    "avatarUrl": "./assets/images/Mark.jpg",
                    "rating": 5,
                    "comment": "After a terrible experience with another provider where my transfer got stuck, I switched here. The security measures feel robust, and their tracking system is very clear. When I needed clarification on a recipient detail, their support team resolved it promptly. Feels much safer now."
                },
                {
                    "reviewerName": "Rachel Thompson",
                    "avatarUrl": "./assets/images/Rachel.jpg",
                    "rating": 4.5,
                    "comment": "This service has saved me so much time! No more trips to the bank or complicated wire transfer forms. I can send money to my relatives in Mexico directly from my phone in minutes. The convenience is unbeatable, and the rates are fair. Truly makes life easier!"
                }
            ]
        },
        {
            "id": 2,
            "reviews": [
                {
                    "reviewerName": "John Taylor",
                    "avatarUrl": "./assets/images/John-Taylor.jpg",
                    "rating": 4,
                    "comment": "Their international payment service is consistently reliable. We use it for paying overseas suppliers, and the funds always arrive on time. The exchange rates are competitive, which helps our bottom line. A dependable solution for small businesses needing international reach."
                },
                {
                    "reviewerName": "Lisa Carter",
                    "avatarUrl": "./assets/images/Lisa-Carter.jpg",
                    "rating": 4.5,
                    "comment": "The exchange rates and low fees significantly beat my old bank transfer method. I've saved a noticeable amount sending tuition fees abroad for my daughter. Their support team is also very responsive; they quickly answered my query about transfer limits. Highly recommend!"
                },
                {
                    "reviewerName": "Amelia Brown",
                    "avatarUrl": "./assets/images/Amelia.jpg",
                    "rating": 5,
                    "comment": "Absolutely essential for my online store with international customers. Processing refunds or paying affiliates abroad is lightning fast and incredibly straightforward through their platform. Clients have even mentioned how easy it was to receive payments. A lifesaver!"
                },
                {
                    "reviewerName": "Henry Walker",
                    "avatarUrl": "./assets/images/Henry.jpg",
                    "rating": 5,
                    "comment": "I regularly send money to family in both Nigeria and the UK. This platform makes it easy to manage multiple recipients and currencies. The transfers are quick, and I appreciate the clear fee structure. It simplifies what used to be a complex process."
                },
                {
                    "reviewerName": "Hannah Smith",
                    "avatarUrl": "./assets/images/Hannah.jpg",
                    "rating": 4.5,
                    "comment": "Just started using this service a week ago to send money to Australia, and I'm already impressed. The sign-up was quick, the interface is intuitive, and the first transfer was completed much faster than I expected. Feels like a trustworthy and efficient service. Wish I'd found it sooner!"
                }
            ]
        },
        {
            "id": 3,
            "reviews": [
                {
                    "reviewerName": "Sarah Mitchell",
                    "avatarUrl": "./assets/images/Sarah-Mitchell-1.jpg",
                    "rating": 4.5,
                    "comment": "We've been using this service for almost a year for our business's international payroll to India and Poland. It's hands down the best value we've found. The pricing is transparent, transfers are reliable, and their customer service is outstanding whenever we've had questions. Can't imagine going back to traditional bank wires. Highly valuable!"
                },
                {
                    "reviewerName": "Emily Clarke",
                    "avatarUrl": "./assets/images/Emily.jpg",
                    "rating": 3.5,
                    "comment": "Setting up my first international transfer to Canada was pretty easy with their app, which was great for a beginner like me. The instructions were clear. The transfer went through, though it took slightly longer than the estimate given. Overall good, but speed could be more consistent. Still recommend it for ease of use."
                },
                {
                    "reviewerName": "Jake Miller",
                    "avatarUrl": "./assets/images/Jake.jpg",
                    "location": "Austin, TX",
                    "rating": 5,
                    "comment": "Been using this service for over a year now to support my parents overseas in Spain. Rock solid reliability. Never had a transfer fail or get delayed unexpectedly. Fees are reasonable, and the exchange rate is always clearly displayed. It’s a relief knowing the money gets there safely every time."
                },
                {
                    "reviewerName": "Liam Brown",
                    "avatarUrl": "./assets/images/Liam.jpg",
                    "rating": 4.5,
                    "comment": "This company provides an incredibly reliable money transfer service. Whenever I've had a question about a transfer status to Colombia, their support team responded quickly and effectively via chat. The app is straightforward, and my transfers have always been dependable. Great peace of mind."
                }
            ]
        }
    ]
}