{
    "reviewGroups": [
        {
            "id": 1,
            "reviews": [
                {
                    "reviewerName": "Rahul Deshmukh",
                    "avatarUrl": "/assets/images/Tom.jpg",
                    "rating": 5,
                    "DateAndTime": "10:25 AM · May 15, 2025",
                    "comment": "I've been using this service for six months now to send money to my family back home. It’s super convenient, and the interface is very clean. What I love the most is there are no hidden charges what you see is what you pay."
                },
                {
                    "reviewerName": "Omar Farooq",
                    "avatarUrl": "/assets/images/John.png",
                    "rating": 4,
                    "DateAndTime": "1:50 PM · Apr 18, 2025",
                    "comment": "Sending AED to India used to feel like a task until I found this site. Now I can send money in minutes, right from my phone."
                },
                {
                    "reviewerName": "Laura Bennett",
                    "avatarUrl": "/assets/images/Ryan.jpg",
                    "rating": 5.0,
                    "DateAndTime": "17:15 PM · Mar 20, 2025",
                    "comment": "As someone who’s not very tech-savvy, I was pleasantly surprised by how easy it was to send EUR to India. The platform is intuitive, and I received great support when I had a question about exchange timing. Will definitely use again."
                }
            ]
        },
        {
            "id": 2,
            "reviews": [
                {
                    "reviewerName": "Arjun Nair",
                    "avatarUrl": "/assets/images/krunal.jpg",
                    "rating": 4.5,
                    "DateAndTime": "11:40 AM · Mar 26, 2025",
                    "comment": "I needed to send USD to my son for his university tuition in Mumbai. The transaction was quick and stress-free. I especially appreciated the confirmation at each stage. It feels good to know your money is safe and on the way."
                },
                {
                    "reviewerName": "Maya Fernandes",
                    "avatarUrl": "/assets/images/Lisa-Carter.jpg",
                    "rating": 4,
                    "DateAndTime": "2:05 PM · Feb 27, 2025",
                    "comment": "This service is exactly what I needed! I send money regularly to support my family in Goa. The transfers are fast, the fees are low, and the platform is super reliable. No more calling banks or waiting in long queues."
                },
                {
                    "reviewerName": "Zaid Khan",
                    "avatarUrl": "/assets/images/Amelia.jpg",
                    "rating": 4,
                    "DateAndTime": "4:50 PM · Feb 2, 2025",
                    "comment": "I send AUD to my relatives in India every month, and this platform makes it effortless. The exchange rate is always better than what banks offer, and the transfers are lightning fast. Customer support was very polite and helpful too."
                }
            ]
        },
        {
            "id": 3,
            "reviews": [
                {
                    "reviewerName": "Emily Parker",
                    "avatarUrl": "/assets/images/Sarah.jpg",
                    "rating": 5,
                    "DateAndTime": "9:20 AM · Feb 14, 2025",
                    "comment": "Living in Germany, I always worried about international money transfers. But this website really changed that. It guided me step by step, and the money arrived in India much faster than I expected. Truly a reliable service."
                },
                {
                    "reviewerName": "Ritika Sharma",    
                    "avatarUrl": "/assets/images/Emily.avif",
                    "rating": 4.5,
                    "DateAndTime": "6:15 PM · Jan 30, 2025",
                    "comment": "I've tried a few services before, but none were as seamless as this one. I send money from Canada to my parents every month, and this platform gives me complete peace of mind. The exchange rate is always fair, and the app keeps me updated every step of the way."
                },
                {
                    "reviewerName": "Jasmine Lee",
                    "avatarUrl": "/assets/images/Jake.jpg",
                    "rating": 4.5,
                    "DateAndTime": "7:10 PM · Apr 30, 2025",
                    "comment": "This was my first experience with cross-border transfers, and I was nervous. But this platform made the process smooth and transparent. I sent CAD to my friend in Mumbai, and she received it the same day. Impressive!"
                },
                {
                    "reviewerName": "Imran Siddiqui",
                    "avatarUrl": "/assets/images/Liam.jpg",
                    "rating": 5,
                    "DateAndTime": "11:10 AM · Dec 3, 2024",
                    "comment": "I run a small business in Dubai, and I frequently pay suppliers in India. This site saves me time and money. The real-time exchange rate is always on point, and the dashboard helps me keep a clean record of all my transfers."
                },
                {
                    "reviewerName": "Neha Kapoor",
                    "avatarUrl": "/assets/images/Sofia.png",
                    "rating": 5,
                    "DateAndTime": "6:40 PM · Nov 26, 2024",
                    "comment": "I was in a bit of a panic needing to send USD urgently to India for a medical emergency. The process here was lightning fast and incredibly easy to follow. It honestly felt like the platform was built with real families in mind."
                }
            ]
        },
        {
            "id": 4,
            "reviews": [
                {
                    "reviewerName": "Jason Wu",
                    "avatarUrl": "/assets/images/Sarah.jpg",
                    "rating": 4,
                    "DateAndTime": "6:05 PM · Mar 28, 2025",
                    "comment": "I use this site for recurring business transfers in USD to vendors in India. What impresses me is how organized the dashboard is. I can track every payment with ease and download receipts instantly. It helps with accounting too."
                },
                {
                    "reviewerName": "Kevin Singh",
                    "avatarUrl": "/assets/images/Jake.jpg",
                    "rating": 4.5,
                    "DateAndTime": "10:35 AM · Jan 5, 2025",
                    "comment": "Living in Australia, I’ve tried multiple platforms to send AUD to India. This one stands out with its reliability and customer service. Even when I had a query late at night, someone responded right away."
                },
                {
                    "reviewerName": "Shruti Nandan",
                    "avatarUrl": "/assets/images/Emily.avif",
                    "rating": 5,
                    "DateAndTime": "9:00 AM · May 2, 2025",
                    "comment": "I was skeptical at first, but this site truly changed how I send money to India. My father needed urgent funds for a surgery, and the money reached in less than an hour. I will always trust this service it gave me peace in a tough time this appliction is best uses."
                },
                {
                    "reviewerName": "Meera D'Souza",
                    "avatarUrl": "/assets/images/Liam.jpg",
                    "rating": 5,
                    "DateAndTime": "9:35 AM · Dec 28, 2024",
                    "comment": "I often send small amounts in AUD to support a charity in India. This website makes even small transfers worthwhile with its good rates and low fees. The ease of use means I can do it in minutes!"
                }
            ]
        }
    ]
}