{
    "reviewGroups": [
        {
            "id": 1,
            "reviews": [
                {
                    "reviewerName": "Priya Sharma",
                    "avatarUrl": "/assets/images/Tom.jpg",
                    "rating": 5,
                    "DateAndTime": "9:30 AM · Apr 28, 2025",
                    "comment": "I needed to send USD to my parents in India urgently, and I was amazed at how fast and easy the process was on this site. The money reached them within hours! The interface is very user-friendly. Highly recommended."
                },
                {
                    "reviewerName": "Aisha Khan",
                    "avatarUrl": "/assets/images/John.png",
                    "rating": 4,
                    "DateAndTime": "2:45 PM · Apr 10, 2025",
                    "comment": "So easy! Sent USD to INR in minutes. Love it!"
                },
                {
                    "reviewerName": "Michael Chen",
                    "avatarUrl": "/assets/images/Ryan.jpg",
                    "rating": 5.0,
                    "DateAndTime": "17:15 PM · Mar 20, 2025",
                    "comment": "Consistently the best exchange rates I've found for sending AUD to India. I've used other services before, but I always come back here because I know I'm getting a fair deal and saving money. Transparent and efficient."
                }
            ]
        },
        {
            "id": 2,
            "reviews": [
                {
                    "reviewerName": "Sophie Dubois",
                    "avatarUrl": "/assets/images/krunal.jpg",
                    "rating": 4.5,
                    "DateAndTime": "6:05 AM · Mar 5, 2025",
                    "comment": "Sent EUR for a family wedding gift. I had a small query about the transfer, and the customer support team was incredibly responsive and helpful. The funds arrived safely and on time. A very trustworthy service"
                },
                {
                    "reviewerName": "David Miller",
                    "avatarUrl": "/assets/images/Lisa-Carter.jpg",
                    "rating": 4,
                    "DateAndTime": "12:30 PM · Feb 18, 2025",
                    "comment": "I appreciate the transparency with the fees when sending CAD to India. There are no hidden charges, and what you see is what you get. The whole process was straightforward and much simpler than I expected."
                },
                {
                    "reviewerName": "Fatima Al Hammadi",
                    "avatarUrl": "/assets/images/Amelia.jpg",
                    "rating": 4.5,
                    "DateAndTime": "4:50 PM · Feb 2, 2025",
                    "comment": "Living in the UAE, sending AED to support my family in India is a regular occurrence. This website has made it so convenient and hassle-free. The rates are competitive, and the platform is reliable every single time."
                }
            ]
        },
        {
            "id": 3,
            "reviews": [
                {
                    "reviewerName": "Ben Carter",
                    "avatarUrl": "/assets/images/Sarah.jpg",
                    "rating": 5,
                    "DateAndTime": "10:00 AM · Jan 25, 2025",
                    "comment": " I’ve used a few different services to send USD to India, and this platform is by far the best. Faster processing, better rates, and a much smoother user experience. I particularly liked the tracking feature. No going back for me!"
                },
                {
                    "reviewerName": "Ananya Reddy",
                    "avatarUrl": "/assets/images/Emily.avif",
                    "rating": 4.5,
                    "DateAndTime": "8:20 PM · Jan 7, 2025",
                    "comment": "This was my first time sending EUR to India, and I was a bit nervous. Your platform made it incredibly easy, guiding me through each step. The money arrived much quicker than I anticipated. So relieved and happy with the service!"
                },
                {
                    "reviewerName": "Chloe Wilson",
                    "avatarUrl": "/assets/images/Jake.jpg",
                    "location": "Austin, TX",
                    "rating": 4,
                    "DateAndTime": "1:35 PM · Dec 19, 2024",
                    "comment": "I'm a repeat customer for sending CAD to my relatives in India. Always a fantastic experience – reliable, consistently good exchange rates, and quick transfers. Wouldn't trust anyone else with my money transfers to India."
                },
                {
                    "reviewerName": "Aarav Patel",
                    "avatarUrl": "/assets/images/Liam.jpg",
                    "rating": 4.5,
                    "DateAndTime": "11:10 AM · Dec 3, 2024",
                    "comment": "Sending USD to India for my brother's education was seamless. The platform guided me perfectly, and the funds were credited incredibly fast. The competitive exchange rate was a definite bonus. Will be using this for all future transfers!"
                },
                {
                    "reviewerName": "Olivia Garcia",
                    "avatarUrl": "/assets/images/Sofia.png",
                    "rating": 5,
                    "DateAndTime": "6:40 PM · Nov 26, 2024",
                    "comment": "I've been using this service for my monthly AUD transfers to family in India for over a year now. It's consistently reliable, the rates are always fair, and I've never faced a single issue. It gives me such peace of mind."
                }
            ]
        },
        {
            "id": 4,
            "reviews": [
                {
                    "reviewerName": "Isabella Rossi",
                    "avatarUrl": "/assets/images/Sarah.jpg",
                    "rating": 4,
                    "DateAndTime": "7:55 AM · Nov 8, 2024",
                    "comment": "Compared to my bank, sending CAD to India through this site saved me a significant amount, not just on fees but also on the exchange rate. Plus, it was so much faster! No more long queues or complicated paperwork for me"
                },
                {
                    "reviewerName": "Mohammed Khan",
                    "avatarUrl": "/assets/images/Jake.jpg",
                    "rating": 5,
                    "DateAndTime": "3:00 PM · Oct 30, 2024",
                    "comment": "Transferring AED to my parents in India is a regular task, and your website has made it remarkably convenient. I can do it from anywhere, and the process is always smooth. The notifications at each step are very reassuring."
                },
                {
                    "reviewerName": "Noah Williams",
                    "avatarUrl": "/assets/images/Emily.avif",
                    "rating": 4.5,
                    "DateAndTime": "8:45 AM · Oct 11, 2024",
                    "comment": "For my business payments in USD to suppliers in India, this platform has been a game-changer. The transfers are prompt, the interface is professional, and the record-keeping is excellent. It streamlines my international payments effortlessly."
                },
                {
                    "reviewerName": "Emily Brown",
                    "avatarUrl": "/assets/images/Liam.jpg",
                    "rating": 5,
                    "DateAndTime": "9:05 PM · Sep 22, 2024",
                    "comment": "I often send small amounts in AUD to support a charity in India. This website makes even small transfers worthwhile with its good rates and low fees. The ease of use means I can do it in minutes!"
                }
            ]
        }
    ]
}